<!-- dflook/terraform-github-actions {"workspace":"junit-xml-2","backend_type":"remote","backend":"3cfd0292f50eed8b6b6553c7dbccbb0de49b8e0e2493030e48d8eac6fee412fd","plan_job_ref":"Job Test Terraform cloud #286 at https://github.com/dflook/terraform-github-actions/actions/runs/13593618327","plan_hash":"bd0760fa44b66afb5cc2e27d05fa46ea2cbf217459de6ecd445e50a205beb256","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __junit-xml-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #286](https://github.com/dflook/terraform-github-actions/actions/runs/13593618327)